PerfomanceTests/results/npgsqlrest-perf_test_record-100rec.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: api-test.js
     output: -

  scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
           * breaking: Up to 100 looping VUs for 1m0s over 1 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/100 VUs, 971 complete and 0 interrupted iterations
breaking   [   2% ] 002/100 VUs  0m01.0s/1m00.0s

running (0m02.0s), 004/100 VUs, 2412 complete and 0 interrupted iterations
breaking   [   3% ] 004/100 VUs  0m02.0s/1m00.0s

running (0m03.0s), 005/100 VUs, 4136 complete and 0 interrupted iterations
breaking   [   5% ] 005/100 VUs  0m03.0s/1m00.0s

running (0m04.0s), 007/100 VUs, 6164 complete and 0 interrupted iterations
breaking   [   7% ] 007/100 VUs  0m04.0s/1m00.0s

running (0m05.0s), 009/100 VUs, 8414 complete and 0 interrupted iterations
breaking   [   8% ] 009/100 VUs  0m05.0s/1m00.0s

running (0m06.0s), 010/100 VUs, 10989 complete and 0 interrupted iterations
breaking   [  10% ] 010/100 VUs  0m06.0s/1m00.0s

running (0m07.0s), 012/100 VUs, 13655 complete and 0 interrupted iterations
breaking   [  12% ] 012/100 VUs  0m07.0s/1m00.0s

running (0m08.0s), 014/100 VUs, 16549 complete and 0 interrupted iterations
breaking   [  13% ] 014/100 VUs  0m08.0s/1m00.0s

running (0m09.0s), 015/100 VUs, 19498 complete and 0 interrupted iterations
breaking   [  15% ] 015/100 VUs  0m09.0s/1m00.0s

running (0m10.0s), 017/100 VUs, 22675 complete and 0 interrupted iterations
breaking   [  17% ] 017/100 VUs  0m10.0s/1m00.0s

running (0m11.0s), 019/100 VUs, 25806 complete and 0 interrupted iterations
breaking   [  18% ] 019/100 VUs  0m11.0s/1m00.0s

running (0m12.0s), 020/100 VUs, 29082 complete and 0 interrupted iterations
breaking   [  20% ] 020/100 VUs  0m12.0s/1m00.0s

running (0m13.0s), 022/100 VUs, 32486 complete and 0 interrupted iterations
breaking   [  22% ] 022/100 VUs  0m13.0s/1m00.0s

running (0m14.0s), 024/100 VUs, 35738 complete and 0 interrupted iterations
breaking   [  23% ] 024/100 VUs  0m14.0s/1m00.0s

running (0m15.0s), 025/100 VUs, 39080 complete and 0 interrupted iterations
breaking   [  25% ] 025/100 VUs  0m15.0s/1m00.0s

running (0m16.0s), 027/100 VUs, 42266 complete and 0 interrupted iterations
breaking   [  27% ] 027/100 VUs  0m16.0s/1m00.0s

running (0m17.0s), 029/100 VUs, 45856 complete and 0 interrupted iterations
breaking   [  28% ] 029/100 VUs  0m17.0s/1m00.0s

running (0m18.0s), 030/100 VUs, 49162 complete and 0 interrupted iterations
breaking   [  30% ] 030/100 VUs  0m18.0s/1m00.0s

running (0m19.0s), 032/100 VUs, 52557 complete and 0 interrupted iterations
breaking   [  32% ] 032/100 VUs  0m19.0s/1m00.0s

running (0m20.0s), 033/100 VUs, 56181 complete and 0 interrupted iterations
breaking   [  33% ] 033/100 VUs  0m20.0s/1m00.0s

running (0m21.0s), 035/100 VUs, 59567 complete and 0 interrupted iterations
breaking   [  35% ] 035/100 VUs  0m21.0s/1m00.0s

running (0m22.0s), 037/100 VUs, 63216 complete and 0 interrupted iterations
breaking   [  37% ] 037/100 VUs  0m22.0s/1m00.0s

running (0m23.0s), 038/100 VUs, 66612 complete and 0 interrupted iterations
breaking   [  38% ] 038/100 VUs  0m23.0s/1m00.0s

running (0m24.0s), 040/100 VUs, 70254 complete and 0 interrupted iterations
breaking   [  40% ] 040/100 VUs  0m24.0s/1m00.0s

running (0m25.0s), 042/100 VUs, 73867 complete and 0 interrupted iterations
breaking   [  42% ] 042/100 VUs  0m25.0s/1m00.0s

running (0m26.0s), 043/100 VUs, 77369 complete and 0 interrupted iterations
breaking   [  43% ] 043/100 VUs  0m26.0s/1m00.0s

running (0m27.0s), 045/100 VUs, 81001 complete and 0 interrupted iterations
breaking   [  45% ] 045/100 VUs  0m27.0s/1m00.0s

running (0m28.0s), 047/100 VUs, 84554 complete and 0 interrupted iterations
breaking   [  47% ] 047/100 VUs  0m28.0s/1m00.0s

running (0m29.0s), 048/100 VUs, 88236 complete and 0 interrupted iterations
breaking   [  48% ] 048/100 VUs  0m29.0s/1m00.0s

running (0m30.0s), 050/100 VUs, 91820 complete and 0 interrupted iterations
breaking   [  50% ] 050/100 VUs  0m30.0s/1m00.0s

running (0m31.0s), 052/100 VUs, 95565 complete and 0 interrupted iterations
breaking   [  52% ] 052/100 VUs  0m31.0s/1m00.0s

running (0m32.0s), 053/100 VUs, 99180 complete and 0 interrupted iterations
breaking   [  53% ] 053/100 VUs  0m32.0s/1m00.0s

running (0m33.0s), 055/100 VUs, 102864 complete and 0 interrupted iterations
breaking   [  55% ] 055/100 VUs  0m33.0s/1m00.0s

running (0m34.0s), 057/100 VUs, 106621 complete and 0 interrupted iterations
breaking   [  57% ] 057/100 VUs  0m34.0s/1m00.0s

running (0m35.0s), 058/100 VUs, 110226 complete and 0 interrupted iterations
breaking   [  58% ] 058/100 VUs  0m35.0s/1m00.0s

running (0m36.0s), 060/100 VUs, 113984 complete and 0 interrupted iterations
breaking   [  60% ] 060/100 VUs  0m36.0s/1m00.0s

running (0m37.0s), 062/100 VUs, 117621 complete and 0 interrupted iterations
breaking   [  62% ] 062/100 VUs  0m37.0s/1m00.0s

running (0m38.0s), 063/100 VUs, 121376 complete and 0 interrupted iterations
breaking   [  63% ] 063/100 VUs  0m38.0s/1m00.0s

running (0m39.0s), 065/100 VUs, 125122 complete and 0 interrupted iterations
breaking   [  65% ] 065/100 VUs  0m39.0s/1m00.0s

running (0m40.0s), 066/100 VUs, 128880 complete and 0 interrupted iterations
breaking   [  67% ] 066/100 VUs  0m40.0s/1m00.0s

running (0m41.0s), 068/100 VUs, 132650 complete and 0 interrupted iterations
breaking   [  68% ] 068/100 VUs  0m41.0s/1m00.0s

running (0m42.0s), 070/100 VUs, 136357 complete and 0 interrupted iterations
breaking   [  70% ] 070/100 VUs  0m42.0s/1m00.0s

running (0m43.0s), 071/100 VUs, 140037 complete and 0 interrupted iterations
breaking   [  72% ] 071/100 VUs  0m43.0s/1m00.0s

running (0m44.0s), 073/100 VUs, 143796 complete and 0 interrupted iterations
breaking   [  73% ] 073/100 VUs  0m44.0s/1m00.0s

running (0m45.0s), 075/100 VUs, 147546 complete and 0 interrupted iterations
breaking   [  75% ] 075/100 VUs  0m45.0s/1m00.0s

running (0m46.0s), 076/100 VUs, 151393 complete and 0 interrupted iterations
breaking   [  77% ] 076/100 VUs  0m46.0s/1m00.0s

running (0m47.0s), 078/100 VUs, 155142 complete and 0 interrupted iterations
breaking   [  78% ] 078/100 VUs  0m47.0s/1m00.0s

running (0m48.0s), 080/100 VUs, 158747 complete and 0 interrupted iterations
breaking   [  80% ] 080/100 VUs  0m48.0s/1m00.0s

running (0m49.0s), 081/100 VUs, 162123 complete and 0 interrupted iterations
breaking   [  82% ] 081/100 VUs  0m49.0s/1m00.0s

running (0m50.0s), 083/100 VUs, 165772 complete and 0 interrupted iterations
breaking   [  83% ] 083/100 VUs  0m50.0s/1m00.0s

running (0m51.0s), 085/100 VUs, 169604 complete and 0 interrupted iterations
breaking   [  85% ] 085/100 VUs  0m51.0s/1m00.0s

running (0m52.0s), 086/100 VUs, 173336 complete and 0 interrupted iterations
breaking   [  87% ] 086/100 VUs  0m52.0s/1m00.0s

running (0m53.0s), 088/100 VUs, 177011 complete and 0 interrupted iterations
breaking   [  88% ] 088/100 VUs  0m53.0s/1m00.0s

running (0m54.0s), 090/100 VUs, 180737 complete and 0 interrupted iterations
breaking   [  90% ] 090/100 VUs  0m54.0s/1m00.0s

running (0m55.0s), 091/100 VUs, 184430 complete and 0 interrupted iterations
breaking   [  92% ] 091/100 VUs  0m55.0s/1m00.0s

running (0m56.0s), 093/100 VUs, 188131 complete and 0 interrupted iterations
breaking   [  93% ] 093/100 VUs  0m56.0s/1m00.0s

running (0m57.0s), 095/100 VUs, 192004 complete and 0 interrupted iterations
breaking   [  95% ] 095/100 VUs  0m57.0s/1m00.0s

running (0m58.0s), 096/100 VUs, 195741 complete and 0 interrupted iterations
breaking   [  97% ] 096/100 VUs  0m58.0s/1m00.0s

running (0m59.0s), 098/100 VUs, 199543 complete and 0 interrupted iterations
breaking   [  98% ] 098/100 VUs  0m59.0s/1m00.0s

running (1m00.0s), 099/100 VUs, 203361 complete and 0 interrupted iterations
breaking   [ 100% ] 099/100 VUs  1m00.0s/1m00.0s

     ✓ response code was 200

     checks.........................: 100.00% ✓ 203461     ✗ 0     
     data_received..................: 3.2 GB  53 MB/s
     data_sent......................: 51 MB   854 kB/s
     http_req_blocked...............: avg=5.03µs  min=564ns    med=3.19µs   max=15.94ms  p(90)=4.68µs  p(95)=5.36µs 
     http_req_connecting............: avg=459ns   min=0s       med=0s       max=15.85ms  p(90)=0s      p(95)=0s     
   ✓ http_req_duration..............: avg=14.52ms min=873.56µs med=12.25ms  max=132.02ms p(90)=27.72ms p(95)=33.18ms
       { expected_response:true }...: avg=14.52ms min=873.56µs med=12.25ms  max=132.02ms p(90)=27.72ms p(95)=33.18ms
   ✓ http_req_failed................: 0.00%   ✓ 0          ✗ 203461
     http_req_receiving.............: avg=2.04ms  min=31.21µs  med=317.09µs max=82.79ms  p(90)=5.71ms  p(95)=10.44ms
     http_req_sending...............: avg=34.28µs min=3.96µs   med=17.66µs  max=16.33ms  p(90)=26.3µs  p(95)=36.92µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=12.45ms min=593.2µs  med=10.51ms  max=124.41ms p(90)=24.39ms p(95)=29.11ms
     http_reqs......................: 203461  3390.11345/s
     iteration_duration.............: avg=14.72ms min=935.64µs med=12.45ms  max=132.12ms p(90)=27.95ms p(95)=33.42ms
     iterations.....................: 203461  3390.11345/s
     vus............................: 99      min=2        max=99  
     vus_max........................: 100     min=100      max=100 


running (1m00.0s), 000/100 VUs, 203461 complete and 0 interrupted iterations
breaking ✓ [ 100% ] 000/100 VUs  1m0s